backend/spec/fixtures/xml/need_manifest.xml.erb

<?xml version="1.0" encoding="UTF-8"?>
   <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
      <soapenv:Body>
         <ns1:findReadyToManifestRecords soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns1="urn:DeliveryManager/services">
           <warehouseString xsi:type="soapenc:string">DEFAULT</warehouseString>
	   <transactionType xsi:type="soapenc:string">DELIVERY</transactionType>
         </ns1:findReadyToManifestRecords>
      </soapenv:Body>
   </soapenv:Envelope>
